results/results_c5_large/results_c5_large_run3/oltp_read_only_t8/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 63.49 qps: 1021.93 (r/w/o: 894.25/0.00/127.68) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 62.70 qps: 1002.93 (r/w/o: 877.43/0.00/125.50) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 57.60 qps: 921.70 (r/w/o: 806.60/0.00/115.10) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 64.30 qps: 1029.70 (r/w/o: 901.00/0.00/128.70) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 84.30 qps: 1349.20 (r/w/o: 1180.60/0.00/168.60) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 71.50 qps: 1142.10 (r/w/o: 999.10/0.00/143.00) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 61.90 qps: 991.90 (r/w/o: 868.10/0.00/123.80) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 61.40 qps: 978.80 (r/w/o: 856.10/0.00/122.70) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 68.70 qps: 1101.20 (r/w/o: 963.70/0.00/137.50) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 59.10 qps: 947.30 (r/w/o: 829.10/0.00/118.20) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 71.30 qps: 1142.10 (r/w/o: 999.50/0.00/142.60) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 81.30 qps: 1298.20 (r/w/o: 1135.60/0.00/162.60) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            113176
        write:                           0
        other:                           16168
        total:                           129344
    transactions:                        8084   (67.13 per sec.)
    queries:                             129344 (1074.01 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      67.1256
    time elapsed:                        120.4309s
    total number of events:              8084

Latency (ms):
         min:                                   11.16
         avg:                                  118.96
         max:                                  656.38
         95th percentile:                      277.21
         sum:                               961682.69

Threads fairness:
    events (avg/stddev):           1010.5000/11.94
    execution time (avg/stddev):   120.2103/0.14